![title](https://acreditta.b-cdn.net/wp-content/uploads/2025/07/logotipo-Tecmilenio-grande.webp)

In [1]:
import pandas as pd

In [2]:
sales = pd.read_csv(
    "../data/sales/2m Sales Records.csv"
)

In [3]:
sales.head(5)

,Region,Country,Item Type,Sales Channel,Order Priority,Order Date,Order ID,Ship Date,Units Sold,Unit Price,Unit Cost,Total Revenue,Total Cost,Total Profit
0,Australia and Oceania,Australia,Meat,Online,C,4/4/2011,451691138,5/23/2011,4300,421.89,364.69,1814127.00,1568167.00,245960.00
1,Asia,Tajikistan,Personal Care,Online,L,7/12/2018,144177377,8/1/2018,4145,81.73,56.67,338770.85,234897.15,103873.70
2,Sub-Saharan Africa,Mozambique,Cosmetics,Online,H,7/6/2011,982716166,7/17/2011,6407,437.20,263.33,2801140.40,1687155.31,1113985.09
3,Central America and the Caribbean,Panama,Personal Care,Offline,L,5/1/2011,784543836,5/11/2011,2810,81.73,56.67,229661.30,159242.70,70418.60
4,North America,Canada,Fruits,Online,H,11/15/2013,137209212,12/29/2013,2110,9.33,6.92,19686.30,14601.20,5085.10

In [4]:
sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2000000 entries, 0 to 1999999
Data columns (total 14 columns):
 #   Column          Dtype
---  ------          -----
 0   Region          object
 1   Country         object
 2   Item Type       object
 3   Sales Channel   object
 4   Order Priority  object
 5   Order Date      object
 6   Order ID        int64
 7   Ship Date       object
 8   Units Sold      int64
 9   Unit Price      float64
 10  Unit Cost       float64
 11  Total Revenue   float64
 12  Total Cost      float64
 13  Total Profit    float64
dtypes: float64(5), int64(2), object(7)
memory usage: 213.6+ MB

In [5]:
sales.describe()

,Order ID,Units Sold,Unit Price,Unit Cost,Total Revenue,Total Cost,Total Profit
count,2.000000e+06,2.000000e+06,2.000000e+06,2.000000e+06,2.000000e+06,2.000000e+06,2.000000e+06
mean,5.498281e+08,5.001291e+03,2.660943e+02,1.875739e+02,1.330973e+06,9.382071e+05,3.927663e+05
std,2.595514e+08,2.886687e+03,2.169884e+02,1.756701e+02,1.469702e+06,1.149821e+06,3.792533e+05
min,1.000003e+08,1.000000e+00,9.330000e+00,6.920000e+00,9.330000e+00,6.920000e+00,2.410000e+00
25%,3.252543e+08,2.502000e+03,8.173000e+01,3.584000e+01,2.782552e+05,1.620654e+05,9.525306e+04
50%,5.496896e+08,5.002000e+03,1.540600e+02,9.744000e+01,7.856705e+05,4.674197e+05,2.817410e+05
75%,7.744440e+08,7.500000e+03,4.218900e+02,2.633300e+02,1.822250e+06,1.196835e+06,5.658661e+05
max,9.999999e+08,1.000000e+04,6.682700e+02,5.249600e+02,6.682700e+06,5.249600e+06,1.738700e+06

In [ ]:
sales[["Country","Total Cost", "Total Profit"]].sample(10)

               Country  Total Cost  Total Profit
1388682        Algeria  1304525.60     313731.25
734821        Botswana   630144.90     437490.90
38029        Nicaragua    75770.17      57317.73
1375072  Liechtenstein   607635.84     343853.04
614192          Jordan  2093736.83    1382440.37
817539       Macedonia  1407997.44     846635.52
1631918         Mexico    65525.48      22820.29
1142547          Sudan  3090018.37     484655.60
203371          Cyprus    65283.84      28869.12
752279           India    27998.32       9750.86

In [9]:
sales["Total Cost"].sum()

np.float64(1876414125196.57)

In [10]:
# Creamos una pivot
sales.groupby("Order Date")["Total Cost"].sum().reset_index()

     Order Date    Total Cost
0      1/1/2010  5.171110e+08
1      1/1/2011  5.077345e+08
2      1/1/2012  4.390774e+08
3      1/1/2013  4.784137e+08
4      1/1/2014  4.741843e+08
...         ...           ...
3901   9/9/2016  4.974407e+08
3902   9/9/2017  4.900710e+08
3903   9/9/2018  4.308355e+08
3904   9/9/2019  4.023927e+08
3905   9/9/2020  4.306016e+08

[3906 rows x 2 columns]